import random

class hob:
    hobbies = [
    "кулинария",
    "строительство деревянных домиков",
    "садоводство",
    "брейкданс",
    "паркур",
    "шитьё и вышивание",
    "предпринимательство",
    "аэробика",
    "жонглирование",
    "пение",
    "животные (разведение и уход)",
    "растения (разведение и уход)",
    "стрельба",
    "скалолазание",
    "охота",
    "дрочка",
    "собирание грибов и ягод",
    "дзюдо",
    "концерты (посещение)",
    "психология и тренинги ",
    "гадание на картах",
    "стрельба из лука",
    "граффити",
    "бильярд",
    "Видеомонтаж",
    "программирование",
    "рисование",
    "чинить всё",
    "пейнтбол",
    "чтение книг",
    "плавание",
    "рыболовство",
    "дайвинг",
    "изучение языков",
    "дизайн чего-либо",
    "карате",
    "скейтбординг",
    'лечение травами',
    'мастерская',
    'стратегические игры',
    'каратэ',
    'написание битов',
    'спорт',
    'аэрофотография',
    'аэромоделирование',
    'коллекционерование листиков',
    'мейк-ап',
    'автомобили',
    'написание рассказов',
    'косплэй',
    'собирание пазлов'
    "сборка и разборка ручки на скорость"
    "сталкеринг"
    "сборка мебели из икеа"
    "подделка документов в Gimp"
    "формула 1 (фанат)"
]
class Generator_hob:
    @staticmethod
    def generate_card():
        hobbia = random.choice(hob.hobbies)
        experience_number = random.randint(1, 60)
        if experience_number <= 11:
            unit = random.choice(["месяцев", "лет"])
        else:
            unit = "лет"
        experience = f"{experience_number} {unit}"
        return{
            "Хобби": hobbia,
            "Стаж": experience
        }