import random

health = [
    "полностью здоров",
    "ожирение",
    "туберкулёз",
    "слепота",
    "наркомания",
    "алкоголизм",
    "аллергия на солнечный свет",
    "аллергия на воду",
    "аллергия на пыль",
    "сумасшествие",
    "сахарный диабет",
    "рак легких",
    "рак кожи",
    "рак груди",
    "рак мочевого пузыря",
    "рак печени",
    "рак желудка",
    "дальтонизм",
    "рак мозга",
    "гастрит",
    "язва",
    "без 1 ноги",
    "без ног",
    "без руки",
    "глухой",
    "без рук",
    "нет рук и ног",
    "СПИД",
    "ВИЧ",
    "хламидии",
    "косоглазие",
    "болезнь Альцгеймера",
    "импотенция",
    "игромания",
    "педофилия",
    "коронавирус",
    "сифилис",
    "лейкоз",
    "биполярное расстройство",
    "скалеоз",
    "мигрень",
    "лейкемия",
    "деффекты речи",
    "синдром Туретта",
    "гастрит",
    "геппатит В",
    "кариес",
    "умственная отсталость",
    "эпилепсия",
    "простуда",
    "ушиб руки",
    "расятжение ноги",
    "аллеригия на воду",
    "аллергия на кокс",
    "хроническая боязнь дверей",
    "невосприимчивость к кофе",
    "синдром постоянной жажды",
    "аллергия на одежду синего цвета",
    "хроническое желание есть только макароны",
    "непереносимость пятниц",
    "аллергия на холод"
]

no_progress = [
    "полностью здоров",
    "сумасшествие",
    "дальтонизм",
    "без 1 ноги",
    "без ног",
    "без руки",
    "без рук",
    "нет рук и ног",
    "глухой",
    "импотенция",
    "педофилия",
    "лейкемия",
    "гепатит В"
]


def generate_card(num_entries=14):
    choices = []
    for _ in range(num_entries):
        disease_choice = random.choice(health)
        progress = "не применим" if disease_choice in no_progress else f"{random.randint(1, 100)}%"
        # Добавляем сразу строку с текстом
        choices.append(f"Диагноз: {disease_choice}, Прогресс: {progress}")

    # Формируем карточку
    card_lines = ["Состояние здоровья:"]
    for i, line in enumerate(choices, start=1):
        card_lines.append("="*70)
        card_lines.append(f"{i}: {line}")

    return "\n".join(card_lines)


# Генерация карточки и запись в файл
player_card = generate_card()
with open(r"Z:\Bunker2026\ReRollAll\RehealthAll.txt", "w", encoding="utf-8") as file:
    file.write(player_card)
