import random

hobbies = [
    "кулинария",
    "строительство деревянных домиков",
    "садоводство",
    "брейкданс",
    "паркур",
    "шитьё и вышивание",
    "предпринимательство",
    "аэробика",
    "жонглирование",
    "пение",
    "животные (разведение и уход)",
    "растения (разведение и уход)",
    "стрельба",
    "скалолазание",
    "охота",
    "дрочка",
    "собирание грибов и ягод",
    "дзюдо",
    "концерты (посещение)",
    "психология и тренинги ",
    "гадание на картах",
    "стрельба из лука",
    "граффити",
    "бильярд",
    "Видеомонтаж",
    "программирование",
    "рисование",
    "чинить всё",
    "пейнтбол",
    "чтение книг",
    "плавание",
    "рыболовство",
    "дайвинг",
    "изучение языков",
    "дизайн чего-либо",
    "карате",
    "скейтбординг",
    'лечение травами',
    'мастерская',
    'стратегические игры',
    'каратэ',
    'написание битов',
    'спорт',
    'аэрофотография',
    'аэромоделирование',
    'коллекционерование листиков',
    'мейк-ап',
    'автомобили',
    'написание рассказов',
    'косплэй',
    'собирание пазлов',
    "сборка и разборка ручки на скорость",
    "сталкеринг",
    "сборка мебели из икеа",
    "подделка документов в Gimp",
    "формула 1 (фанат)",
]


def generate_card(num_entries=14):
    choices = []
    for _ in range(num_entries):
        hobbies_choice = random.choice(hobbies)
        experience_number2 = random.randint(1, 60)
        if experience_number2 == 1:
            unit2 = "год"
        elif experience_number2 < 12:
            unit2 = "месяцев"
        else:
            unit2 = "лет"
        experience2 = f"{experience_number2} {unit2}"

        # Формируем строку с Хобби и Стаж
        choices.append(f"Хобби: {hobbies_choice}\nСтаж: {experience2}")

    # Формируем карточку
    card_lines = ["Хобби игроков:"]
    for i, line in enumerate(choices, start=1):
        card_lines.append("="*70)
        card_lines.append(f"{i}: {line}")

    return "\n".join(card_lines)



# Генерация карточки и запись в файл
player_card = generate_card()
with open(r"Z:\Bunker2026\ReRollAll\RehobbieAll.txt", "w", encoding="utf-8") as file:
    file.write(player_card)
