import random

#====ДАННЫЕ=====
disease = [
    "полностью здоров",
    "ожирение",
    "туберкулёз",
    "слепота",
    "наркомания",
    "алкоголизм",
    "аллергия на солнечный свет",
    "аллергия на воду",
    "аллергия на пыль",
    "сумасшествие",
    "сахарный диабет",
    "рак легких",
    "рак кожи",
    "рак груди",
    "рак мочевого пузыря",
    "рак печени",
    "рак желудка",
    "дальтонизм",
    "рак мозга",
    "гастрит",
    "язва",
    "без 1 ноги",
    "без ног",
    "без руки",
    "глухой",
    "без рук",
    "нет рук и ног",
    "СПИД",
    "ВИЧ",
    "хламидии",
    "косоглазие",
    "болезнь Альцгеймера",
    "импотенция",
    "игромания",
    "педофилия",
    "коронавирус",
    "сифилис",
    "лейкоз",
    "биполярное расстройство",
    "скалеоз",
    "мигрень",
    "лейкемия",
    "деффекты речи",
    "синдром Туретта",
    "гастрит",
    "геппатит В",
    "кариес",
    "умственная отсталость",
    "эпилепсия",
    "простуда",
    "ушиб руки",
    "расятжение ноги",
    "аллеригия на воду",
    "аллергия на кокс",
    "хроническая боязнь дверей",
    "невосприимчивость к кофе",
    "синдром постоянной жажды",
    "аллергия на одежду синего цвета",
    "хроническое желание есть только макароны",
    "непереносимость пятниц",
    "аллергия на холод"
]

no_progress = [
    "полностью здоров",
    "сумасшествие",
    "дальтонизм",
    "без 1 ноги",
    "без ног",
    "без руки",
    "без рук",
    "нет рук и ног",
    "глухой",
    "импотенция",
    "педофилия",
    "лейкемия",
    "гепатит В"
]

# ===== ГЕНЕРАЦИЯ ХАРАКТЕРИСТИК =====
def generate_card():
    disease_choice = random.choice(disease)
    progress = "не применим" if disease_choice in no_progress else f"{random.randint(1, 100)}%"
    
#========СБОРКА КАРТОЧКИ ========
    player_card = f"""
Состояние здоровья:
Диагноз: {disease_choice}
Прогресс: {progress}
    """.strip()
    
    return player_card

# ===== Вызов функции и запись в файлы =====
player_card = generate_card()
with open(r"Z:\Bunker2026\ReRoll\Rehealth.txt", "w", encoding="utf-8") as file:
    file.write(player_card)
