import random

# ====ДАННЫЕ=====
hobbies = [
    "кулинария",
    "строительство деревянных домиков",
    "садоводство",
    "брейкданс",
    "паркур",
    "шитьё и вышивание",
    "предпринимательство",
    "аэробика",
    "жонглирование",
    "пение",
    "животные (разведение и уход)",
    "растения (разведение и уход)",
    "стрельба",
    "скалолазание",
    "охота",
    "дрочка",
    "собирание грибов и ягод",
    "дзюдо",
    "концерты (посещение)",
    "психология и тренинги ",
    "гадание на картах",
    "стрельба из лука",
    "граффити",
    "бильярд",
    "Видеомонтаж",
    "программирование",
    "рисование",
    "чинить всё",
    "пейнтбол",
    "чтение книг",
    "плавание",
    "рыболовство",
    "дайвинг",
    "изучение языков",
    "дизайн чего-либо",
    "карате",
    "скейтбординг",
    'лечение травами',
    'мастерская',
    'стратегические игры',
    'каратэ',
    'написание битов',
    'спорт',
    'аэрофотография',
    'аэромоделирование',
    'коллекционерование листиков',
    'мейк-ап',
    'автомобили',
    'написание рассказов',
    'косплэй',
    'собирание пазлов'
    "сборка и разборка ручки на скорость"
    "сталкеринг"
    "сборка мебели из икеа"
    "подделка документов в Gimp"
    "формула 1 (фанат)"
]
# ===== ГЕНЕРАЦИЯ ХАРАКТЕРИСТИК =====


def generate_card():
    hobbie_choice = random.choice(hobbies)
    experience_number2 = random.randint(1, 60)
    if experience_number2 <= 11:
        unit2 = random.choice(["месяцев", "лет"])
    else:
        unit2 = "лет"
    experience2 = f"{experience_number2} {unit2}"

# ========СБОРКА КАРТОЧКИ ========
    player_card = f"""
Хобби:{hobbie_choice}
Стаж:{experience2}
    """.strip()

    return player_card


# ===== Вызов функции и запись в файлы =====
player_card = generate_card()
with open(r"Z:\Bunker2026\ReRoll\Rehobbie.txt", "w", encoding="utf-8") as file:
    file.write(player_card)
