import random

class health:
    diseases = [
        "полностью здоров",
        "ожирение",
        "туберкулёз",
        "слепота",
        "наркомания",
        "алкоголизм",
        "аллергия на солнечный свет",
        "аллергия на воду",
        "аллергия на пыль",
        "сумасшествие",
        "сахарный диабет",
        "рак легких",
        "рак кожи",
        "рак груди",
        "рак мочевого пузыря",
        "рак печени",
        "рак желудка",
        "дальтонизм",
        "рак мозга",
        "гастрит",
        "язва",
        "без 1 ноги",
        "без ног",
        "без руки",
        "глухой",
        "без рук",
        "нет рук и ног",
        "СПИД",
        "ВИЧ",
        "хламидии",
        "косоглазие",
        "болезнь Альцгеймера",
        "импотенция",
        "игромания",
        "педофилия",
        "коронавирус",
        "сифилис",
        "лейкоз",
        "биполярное расстройство",
        "скалеоз",
        "мигрень",
        "лейкемия",
        "деффекты речи",
        "синдром Туретта",
        "гастрит",
        "геппатит В",
        "кариес",
        "умственная отсталость",
        "эпилепсия",
        "простуда",
        "ушиб руки",
        "расятжение ноги",
        "аллеригия на воду",
        "аллергия на кокс",
        "хроническая боязнь дверей",
        "невосприимчивость к кофе",
        "синдром постоянной жажды",
        "аллергия на одежду синего цвета",
        "хроническое желание есть только макароны",
        "непереносимость пятниц",
        "аллергия на холод"
    ]
    no_progress = [
        "полностью здоров",
        "сумасшествие",
        "дальтонизм",
        "без 1 ноги",
        "без ног",
        "без руки",
        "без рук",
        "нет рук и ног",
        "глухой",
        "импотенция",
        "педофилия",
        "лейкемия",
        "гепатит В"
    ]


class Generator_health:
    @staticmethod
    def generate_card():
        healths = random.choice(health.diseases)
        progress = "не применим" if healths in health.no_progress else f"{random.randint(1, 100)}%"

        return {
            "Диагноз": healths,
            "Прогресс": progress
        }
